---
title: WorksetFilter
classe: Autodesk.Revit.DB.WorksetFilter
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# WorksetFilter

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IncludeStandaloneWorksetsOnly { get; set; }` | `worksetFilter.IncludeStandaloneWorksetsOnly` | Boolean |
| `Boolean Inverted { get; }` | `worksetFilter.Inverted` | Boolean |
| `Boolean IsValidObject { get; }` | `worksetFilter.IsValidObject` | Boolean |
| `Void Dispose()` | `worksetFilter.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```